$ pahole zig-out/bin/cache-aligned | grep -A9 AbcStruct
struct cache-aligned.AbcStruct {
        u16                        a __attribute__((__aligned__(2))); /*     0     2 */
        u16                        b __attribute__((__aligned__(2))); /*     2     2 */
        u8                         c __attribute__((__aligned__(1))); /*     4     1 */
        u8                         padding[3] __attribute__((__aligned__(1))); /*     5     3 */

        /* size: 8, cachelines: 1, members: 4 */
        /* forced alignments: 4 */
        /* last cacheline: 8 bytes */
} __attribute__((__aligned__(2)));

$ pahole zig-out/bin/cache-aligned | grep -A9 AbcStruct
struct cache-aligned.AbcStruct {
        u16                        a __attribute__((__aligned__(2))); /*     0     2 */
        u16                        b __attribute__((__aligned__(2))); /*     2     2 */
        u8                         c __attribute__((__aligned__(1))); /*     4     1 */
        u8                         padding[3] __attribute__((__aligned__(1))); /*     5     3 */

        /* size: 8, cachelines: 1, members: 4 */
        /* forced alignments: 4 */
        /* last cacheline: 8 bytes */
} __attribute__((__aligned__(2)));

$ pahole zig-out/bin/misaligned | grep -A8 AbcStruct
struct misaligned.AbcStruct {
        u16                        a __attribute__((__aligned__(1))); /*     0     2 */
        u16                        b __attribute__((__aligned__(1))); /*     2     2 */
        u8                         c __attribute__((__aligned__(1))); /*     4     1 */

        /* size: 5, cachelines: 1, members: 3 */
        /* forced alignments: 3 */
        /* last cacheline: 5 bytes */
} __attribute__((__packed__));
